# Ваня та Марійка продовжують грати в гру, але Ваня почав шахраювати. На кожне з
# питань Марійки він вибирає такий варіант відповіді YES або NO, щоб множина можливих
# задуманих чисел залишалося якомога більшою. Наприклад, якщо Ваня задумав число від 1
# до 5, а Марійка запитала про числа 1 і 2, то Ваня відповість NO, а якщо Марійка запитає
# про 1, 2, 3, то серпень відповість YES.
# Якщо ж Марійка у своєму питанні перераховує рівно половину із задуманих чисел, то Ваня
# із шкідливості завжди відповідає NO. Нарешті, Ваня при відповіді враховує всі попередні
# питання Беатрис і свої відповіді на них, тобто безліч можливих задуманих чисел
# зменшується.
# Перший рядок містить найбільше, яке міг загадати Ваня. Кожен наступний рядок
# містить чергове питання Марійка: набір чисел, розділених пробілами. Останній рядок
# вхідних даних містить одне слово HELP.
# Для кожного питання Марійка виведіть відповідь Ваня на це запитання. Після цього
# виведіть через пробіл, у порядку зростання, усі числа, які міг загадати Ваня після відповіді
# на всі питання Марійка.

n = int(input())
all_nums = set(range(1, n + 1))
possible_nums = all_nums
while True:
    guess = input()
    if guess == 'HELP':
        break
    guess = {int(x) for x in guess.split()}
    if len(possible_nums & guess) > len(possible_nums) / 2:
        print('YES')
        possible_nums &= guess
    else:
        print('NO')
        possible_nums &= all_nums - guess

print(' '.join([str(x) for x in sorted(possible_nums)]))
