# Політичне життя однієї країни дуже жваве. У країні діє К політичних партій, кожна з яких
# регулярно оголошує національний страйк. Дні, коли хоч одна з партій оголошує страйк,
# за умови, що це не субота чи неділя (коли й так ніхто не працює), завдають великих
# збитків економіці країни.
# i-я партія оголошує страйки кожні b_i днів, починаючи з дня з номером a_i. Тобто i-я
# партія оголошує страйки у дні a_i, a_i+b_i, a_i+2*b_i тощо. Якщо в якийсь день кілька
# партій оголошує страйк, то це вважається одним загальнонаціональним страйком.
# У календарі країни N днів, пронумерованих, починаючи з одиниці. Перший день року є
# понеділком, шостим та сьомим дні року — вихідні, тиждень складається з семи днів.
# У першому рядку дані числа N і K. Далі йде K рядків, що описують графіки проведення
# страйків. i-й рядок містить числа a_i та b_i. Вам потрібно визначити кількість страйків,
# що відбулися в цій країні протягом року.

N, K = [int(i) for i in input().split()]
A = set()
mass = [[int(i) for i in input().split()] for j in range(K)]
for i in range(K):
    day = mass[i][0]
    start = mass[i][0]
    step = mass[i][1]
    while day <= N:
        if day % 7 != 0 and day % 7 != 6:
            A.add(day)
        day += step
print(len(A))
