# Дано список чисел. Визначте, скільки у ньому зустрічається різних чисел.
# Примітка. Це завдання на Пітоні можна вирішити в один рядок.

print(len(set(input().split())))
