# Аня і Боря люблять грати в різнокольорові кубики, причому у кожного їх свій набір і в
# кожному наборі всі кубики різні за кольором. Якось діти зацікавилися, скільки існують
# кольорів таких, що кубики кожного кольору присутні в обох наборах. Для цього вони
# занумерували всі кольори випадковими числами від 0 до 108. На цьому їх ентузіазм
# вичерпався, тому вам пропонується допомогти їм у частині, що залишилася.
# У першому рядку вхідних даних записано числа N і M — число кубиків у Ані та Борі. У
# наступних N рядках задано номери кольорів кубиків Ані. В останніх M рядках номери
# кольорів Борі.
# Знайдіть три множини: номери кольорів кубиків, які є в обох наборах; номери кольорів
# кубиків, які є тільки у Ані та номери кольорів кубиків, які є тільки у Борі. Для кожного з
# множин виведіть спочатку кількість елементів у ньому, а потім самі елементи,
# відсортовані за зростанням.

n, m = [int(s) for s in input().split()]
A = set()
B = set()
for i in range(n):
    A.add(int(input()))
for i in range(m):
    B.add(int(input()))
print(len(A.intersection(B)))
print(" ".join(str(s) for s in sorted(A.intersection(B))))

print(len(A.difference(B)))
print(" ".join(str(s) for s in sorted(A.difference(B))))

print(len(B.difference(A)))
print(" ".join(str(s) for s in sorted(B.difference(A))))
