# Кожен з деякої множини школярів деякої школи знає кілька мов. Потрібно визначити
# скільки мов знають усі школярі, і скільки мов знає хоча б один із школярів.
# У першому рядку задано кількість школярів. Для кожного зі школярів спочатку записано
# кількість мов, яку він знає, а потім – назви мов, по одному у рядку.
# У першому рядку виведіть кількість мов, які знають усі школярі. Починаючи з другого
# рядка – список таких мов. Потім – кількість мов, які знає хоча б один школяр, на
# наступних рядках – список таких мов. Мови потрібно виводити в лексикографічному
# порядку, по одному на рядку.

arr = []
for sc in range(int(input())):
    L = set()
    for lang in range(int(input())):
        L.update(set(input().split()))
    arr.append(L)
# print(arr)
L = arr[0]
O = set()

for i in range(len(arr)):
    # print(arr[i])
    O.update(arr[i])
    # print(O)
    L.intersection_update(arr[i])

print(len(L))
for item in sorted(L):
    print(item)
print(len(O))
for item in sorted(O):
    print(item)
