# Якось, розбираючи старі книги на горищі, школяр Вася знайшов англо-латинський
# словник. Англійську він на той час знав досконало, і його мрією було вивчити латину. Тому
# словник, що попався, був якраз до речі.
# На жаль, для повноцінного вивчення мови недостатньо лише одного словника: крім англолатинської
# необхідна латинсько-англійська. Через брак кращого він вирішив зробити
# другий словник з першого.
# Як відомо, словник складається з слів, що перекладаються, до кожного з яких наводиться
# кілька слів-перекладів. Для кожного латинського слова, що зустрічається десь у словнику,
# Вася пропонує знайти всі його переклади (тобто всі англійські слова, для яких наше
# латинське зустрічалося в його списку перекладів), і вважати їх тільки їхніми перекладами
# цього латинського слова.
# Допоможіть Васі виконати роботу зі створення латинсько-англійського словника з
# англо-латинського.
# У першому рядку міститься єдине ціле число N - кількість англійських слів у словнику. Далі
# слідує N описів. Кожен опис міститься в окремому рядку, в якому записано спочатку
# англійське слово, потім відокремлений пробілами дефіс, потім розділені комами з
# пробілами переклади цього англійського слова на латинську. Усі слова складаються лише
# з маленьких латинських літер. Переклади відсортовані у лексикографічному порядку.
# Порядок проходження англійських слів у словнику також лексикографічний.
# Виведіть відповідний даному латинсько-англійський словник, точно дотримуючись
# формату вхідних даних. Зокрема, першим має йти переклад лексикографічно мінімального
# латинського слова, далі другого в цьому порядку тощо. Всередині перекладу англійські
# слова також мають бути відсортовані лексикографічно

d = {}
res = {}
res_l = 0
for i in range(int(input())):
    k, lex = input().split(' - ')
    d[k] = lex.split(', ')
    res_l += len(d[k])
for k, v in d.items():
    for vi in v:
        lst = res.get(vi, [])
        lst.append(k)
        res[vi] = lst
print(len(res))
for k in sorted(res):
    print(k, ' - ', ', '.join(res[k]))
