# У генеалогічному дереві у кожної людини, крім родоначальника, є один батько.
# Кожному елементу дерева зіставляється ціле невід'ємне число, яке називається висотою.
# У родоначальника висота дорівнює 0, будь-якого іншого елемента висота на 1 більше, ніж
# у його батька.
# Вам дано генеалогічне дерево, визначте висоту його елементів.
# Програма отримує на вхід число елементів у генеалогічному дереві N. Далі слідує N-1
# рядок, що задають батькам для кожного елемента дерева, крім родоначальника. Кожен
# рядок має вигляд ім'я_нащадок ім'я_батька.
# Програма має вивести список всіх елементів дерева у лексикографічному порядку. Після
# виведення імені кожного елемента слід вивести його висоту.
# Примітка. Це завдання має рішення складності O(n), але вам достатньо написати
# рішення складності O(n2) (крім складності звернення до елементів словника).

T = {}
k = []
for n in range(int(input())-1):
    k = input().split(' ')
    T[k[0]] = [k[1]]
for i in range(len(T)):
    for k, v in T.items():
        if v[-1] in T.keys():
            T[k] = T[k] + (T[v[-1]])
T[(list(T.values())[0][-1])] = []
for k in sorted(T.keys()):
    print(k, len(T[k]))
