# У файлову систему одного суперкомп'ютера проник вірус, який зламав контроль за
# правами доступу до файлів. Для кожного файлу відомо, з якими діями можна звертатися
# до нього:
# запис W,
# читання R,
# запуск X.
# У першому рядку міститься число N — кількість файлів, що містяться в даній файловій
# системі. У наступних N рядках містяться імена файлів і допустимих із нею операцій,
# розділені пробілами. Далі вказано число M - кількість запитів до файлів. В останніх M
# рядках вказано запит на вигляд Операція Файл. До одного і того ж файлу може бути
# застосована будь-яка кількість запитів.20
# Вам потрібно відновити контроль над правами доступу до файлів (ваша програма для
# кожного запиту повинна буде повертати OK якщо над файлом виконується допустима
# операція, або Access denied, якщо операція неприпустима)

perm = {}
op = {'read': 'R', 'write': 'W', 'execute': 'X'}
for n in range(int(input())):
    file = input().split()
    perm[file[0]] = file[1:]
for n in range(int(input())):
    query = input().split()
    if op[query[0]] in perm[query[1]]:
        print('OK')
    else:
        print('Access denied')
