# Дано число n. Створіть масив розміром n×n та заповніть його за таким правилом:
# Числа на діагоналі, що йде з правого верхнього в нижній лівий кут рівні 1.
# Числа, що стоять вище цієї діагоналі, дорівнюють 0.
# Числа, що стоять нижче цієї діагоналі, дорівнюють 2.
# Отриманий масив виведіть на екран. Числа в рядку розділяйте одним пробілом

n = int(input())
a = [[0] * (n - i - 1) + [1] + [2] * i for i in range(n)]
for row in a:
    print(' '.join(str(el) for el in row))
