# Дано непарне число n. Створіть двовимірний масив із n×n елементів, заповнивши його
# символами "." (Кожен елемент масиву є рядком одного символу). Потім заповніть
# символами "*" середній рядок масиву, середній стовпець масиву, головну діагональ та
# побічну діагональ. В результаті одиниці у масиві повинні утворювати зображення
# зірочки. Виведіть отриманий масив на екран, розділяючи елементи масиву пробілами

n = int(input())
a = [["."] * n for i in range(n)]
mid = (n - 1) / 2
for i in range(n):
    for j in range(n):
        if i == j:
            a[i][j] = "*"
            a[i][-(j+1)] = "*"
        if i == mid or j == mid:
            a[i][j] = "*"
for row in a:
    print(" ".join([elem for elem in row]))
