# Знайдіть індекси першого входження максимального елемента. Виведіть два числа: номер
# рядка та номер стовпця, у яких стоїть найбільший елемент у двовимірному масиві. Якщо
# таких елементів кілька, то виводиться той, у якого менший номер рядка, а якщо номери
# рядків рівні, той, у якого менший номер стовпця.
# Програма отримує на вхід розміри масиву n і m, потім рядків n по m чисел в кожній

n, m = [int(i) for i in input().split()]
a = [[0] * m for i in range(n)]
for i in range(n):
    a[i] = [int(i) for i in input().split()]
imaks = 0
jmaks = 0
maks = a[0][0]
for i in range(n):
    for j in range(m):
        if maks < a[i][j]:
            maks = a[i][j]
            imaks = i
            jmaks = j
print(imaks, jmaks)
