# Напишіть функцію capitalize(), яка приймає слово з маленьких латинських літер і
# повертає його, змінюючи першу літеру на велику.
# Наприклад, print(capitalize('word')) має друкувати слово Word.
# На вхід подається рядок, що складається зі слів, розділених одним пропуском. Слова
# складаються із маленьких латинських літер. Надрукуйте вихідний рядок, зробивши так,
# щоб кожне слово починалося з великої літери. При цьому використовуйте функцію
# capitalize().
# Нагадаємо, що в Пітоні є функція ord(), яка за символом повертає код у таблиці ASCII, і
# функція chr(), яка за кодом символу повертає сам символ. Наприклад, ord('a') == 97, chr(97)
# == 'a'.


def capitalize(word):
    word_c = chr(ord(word[0]) - 32) + word[1:]
    return(word_c)


a = [s for s in input().split()]
res = ""
for i in range(len(a)):
    res += capitalize(a[i]) + " "
print(res)
