# Взуттєва фабрика починає випуск елітної моделі взуття. Дірочки для шнурків будуть
# розміщені у два ряди, відстань між якими a, а відстань між дірочками в ряду b. Кількість
# дірочок в кажному ряду N. Шнурування повинно відбуватися елітним способом “наверх,
# по горизонталі в другий ряд, наверх, по горизонталі тощо” (див. рисунок). Крім того, щоб
# шнурки можна було зав’язати елітним бантиком, довжина вільного кінця шнурка повинна
# бути l. Яка повинна бути довжина шнурка для цього взуття?
# Програма отримує на вхід чотири натуральних числа a, b, l і N (порядок важливий) і
# повинна вивести одне число – довжину шнурка.

a = int(input("відстань між рядами шнурків "))
b = int(input("відстань між дірочками в ряду "))
n = int(input("Кількість дірочок в кожному ряду "))
s = int(input("довжина вільного кінця шнурка "))
shn = a + (n - 1) * b * 2 + (n - 1) * a * 2 + s * 2
print("довжина шнурка ", shn)
