# Дано два цілих числа A і В, A>B. Виведіть всі непарні числа від A до B включно у порядку спадання.
# У цій задачі можна не використовувати інструкцію if

a = int(input())
b = int(input())
a = (a+1)//2*2
for x in range(a-1, b-1, -2):
    print(x)
