# Для настільної гри використовуються картки з номерами від 1 до N. Одна картка загубилася.
# Знайдіть її, знаючи номери карток, що залишилися.
# Дано число N, далі N − 1 номер карток, що залишилися (різні числа від 1 до N). Програма має
# вивести номер втраченої картки. Масивами та аналогічними структурами даних
# користуватися не можна.

n = int(input())
s = 0
sum_k = 0
for i in range(1, n + 1):
    s = s + i
for i in range(1, n):
    sum_k = sum_k + int(input())

print(s - sum_k)
