# Дано рядок.
# Спочатку виведіть третій символ цього рядка.
# У другому рядку виведіть передостанній символ цього рядка.
# У третьому рядку виведіть перші п'ять символів цього рядка.
# У четвертому рядку виведіть весь рядок, крім двох останніх символів.
# У п'ятому рядку виведіть усі символи з парними індексами (вважаючи, що індексація
# починається з 0, тому символи виводяться з першого).
# У шостому рядку виведіть усі символи з непарними індексами, тобто, починаючи з
# другого символу рядка.
# У сьомому рядку виведіть усі символи у зворотному порядку.
# У восьмому рядку виведіть усі символи рядка через один у зворотному порядку, починаючи
# з останнього.
# У дев'ятому рядку виведіть довжину цього рядка.

s = input()
print(s[2])
print(s[-2])
print(s[:5])
print(s[:-2])
print(s[::2])
print(s[1::2])
print(s[::-1])
print(s[::-2])
print(len(s))
