# Дано рядок. Замініть у цьому рядку всі появи літери h на літеру H, крім першого та
# останнього входження

s = input()
p1 = s.find("h")
p2 = s.rfind("h")

ss = s[:p1+1] + s[p1+1:p2].replace("h", "H") + s[p2:]

print(ss)
