# Дано рядок. Якщо в цьому рядку літера f зустрічається лише один раз, виведіть індекс.
# Якщо вона зустрічається два і більше разів, виведіть індекс її першої та останньої появи.
# Якщо літера f у цьому рядку не зустрічається, нічого не виводьте.

s = input()
cnt = s.count("f")
if cnt == 1:
    print(s.find("f"))
elif cnt > 1:
    print(str(s.find("f")) + ' ' + str(s.rfind("f")))
