# Дано рядок. Замініть у рядку всі цифри 1 на слово one.

s = input()
print(s.replace("1", "one"))
