# Шаховий король ходить по горизонталі, вертикалі і діагоналі, але тільки на 1 клітинку.
# Дано дві різні клітинки шахової дошки, визначте, чи може король потрапити з першої
# клітини на другу одним ходом. Програма отримує на вхід чотири числа від 1 до 8 кожне,
# що задають номер стовпця і номер рядка спочатку для першої клітини, потім для другої5
# клітини. Програма повинна вивести YES, якщо з першої клітини ходом короля можна
# потрапити в другу або NO в іншому випадку

c1v = int(input("Вертикаль клітини1 "))
c1g = int(input("Горизонталь клітини1 "))
c2v = int(input("Вертикаль клітини2 "))
c2g = int(input("Горизонталь клітини2 "))

if abs(c1v-c2v) <= 1 and abs(c1g-c2g) <= 1:
    print("YES")
else:
    print("NO")
