# Шахова тура ходить по горизонталі або вертикалі. Дано дві різні клітинки шахової
# дошки. Визначте, чи може тура потрапити з першої клітинки на другу одним ходом.
# Програма отримує на вхід чотири числа від 1 до 8 кожне, що задають номер стовпця і
# номер рядка спочатку для першої клітинки, потім для другої клітинки. Програма повинна
# вивести YES, якщо з першої клітинки ходом тури можна потрапити в другу або NO в
# іншому випадку

c1v = int(input("Вертикаль клітини1 "))
c1g = int(input("Горизонталь клітини1 "))
c2v = int(input("Вертикаль клітини2 "))
c2g = int(input("Горизонталь клітини2 "))

if c1v-c2v == 0 or c1g-c2g == 0:
    print("YES")
else:
    print("NO")
