# Яша плавав в басейні розміром N × M метрів і втомився. У цей момент він виявив, що
# знаходиться на відстані x метрів від одного з довгих бортів (не обов'язково від
# найближчого) і y метрів від одного з коротких бортиків. Яку мінімальну відстань
# повинен проплисти Яша, щоб вибратися з басейну на бортик? Програма отримує на вхід
# числа N, M, x, y. Програма повинна вивести число метрів, яке потрібно проплисти Яші до
# бортика.

n = int(input("Довжина басейну "))
m = int(input("Ширина басейну "))
x = int(input("Відстань до довгого борта "))
y = int(input("Відстань до короткого борта "))

if n > m:
    dx = n - y
    dy = m - x
else:
    dx = m - y
    dy = n - x
res = 0
if x < dx:
    res = x
else:
    res = dx
if y < dy and y < res:
    res = y
elif y > dy and dy < res:
    res = dy
print(res)
