# Шаховий кінь ходить буквою "Г" - на дві клітинки по вертикалі в будь-якому напрямку і
# на одну клітинку по горизонталі, або навпаки. Дано дві різні клітинки шахової дошки,
# визначте, чи може кінь потрапити з першої клітинки на другу одним ходом.
# Підказка: різниця ходу одного =2, а іншого =1

c1v = int(input("Вертикаль клітини1 "))
c1g = int(input("Горизонталь клітини1 "))
c2v = int(input("Вертикаль клітини2 "))
c2g = int(input("Горизонталь клітини2 "))

if (abs(c1v-c2v) == 2 and abs(c1g-c2g) == 1) or (abs(c1v-c2v) == 1 and abs(c1g-c2g) == 2):
    print("YES")
else:
    print("NO")
