# Задані дві клітини шахової дошки. Якщо вони пофарбовані в один колір, то виведіть слово
# YES, а якщо в різні кольори - то NO. Програма отримує на вхід чотири числа від 1 до 8
# кожне, що задають номер стовпця і номер рядка спочатку для першої клітини, потім для
# другої клітини.

c1v = int(input("Вертикаль клітини1 "))
c1g = int(input("Горизонталь клітини1 "))
c2v = int(input("Вертикаль клітини2 "))
c2g = int(input("Горизонталь клітини2 "))

if abs(c1v-c2v) % 2 == abs(c1g-c2g) % 2:
    print("YES")
else:
    print("NO")
