# Процентна ставка за вкладом становить P відсотків річних, які додаються до суми
# вкладу. Внесок складає X гривень Y копійок. Визначте розмір вкладу через рік.
# Програма отримує на вхід цілі числа P, X, Y і повинна вивести два числа: величину вкладу
# через рік в гривнях і копійках. Дробова частина копійок відкидається

p = int(input("ставка "))
x = int(input("Внесок, гривень "))
y = int(input("Внесок, копійок "))
x = x + x * p/100
y = y + y * p/100
x = x + 0.01 * y
print((int(x // 1)), int(x % 1 * 100 + 0.0001))
