# Дано список цілих чисел, число k і значення C. Необхідно вставити в список на позицію з
# індексом k елемент, що дорівнює C, зсунувши всі елементи, що мали індекс не менше, ніж
# k, вправо.
# Оскільки кількість елементів у списку збільшується, після зчитування списку в його кінець
# потрібно буде додати новий елемент, використовуючи метод append.
# Вставку необхідно здійснювати вже в даному списку, не роблячи виведення та не
# створюючи додаткового списку

a = [int(d) for d in input().split()]
s = input()
k = int(s[:s.find(" ")])
c = int(s[s.find(" "):])
for i in range(k, len(a)):
    a[i], c = c, a[i]
a.append(c)
print(' '.join(str(d) for d in a))
