# Даний список із чисел та індекс елемента у списку k. Видаліть із списку елемент з індексом
# k, зсунувши вліво всі елементи, що стоять правіше елемента з індексом k.
# Програма отримує список на вхід, потім число k. Програма зсуває всі елементи, а потім
# видаляє останній елемент списку за допомогою методу pop() без параметрів.
# Програма повинна здійснювати зсув безпосередньо у списку, а не робити це під час
# виведення елементів. Також не можна використовувати додатковий перелік. Також не
# слід використовувати метод pop(k) із параметром.

a = [int(s) for s in input().split()]
k = int(input())
for i in range(k, len(a)-1):
    a[i] = a[i+1]
a.pop()
print(' '.join(str(s) for s in a))
